_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 7, 200)            1088731200
_________________________________________________________________
time_distributed_1 (TimeDist (None, 7, 64)             12800     
_________________________________________________________________
bidirectional_1 (Bidirection (None, 128)               66048     
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 1032      
=================================================================
Total params: 1,088,811,080
Trainable params: 79,880
Non-trainable params: 1,088,731,200
_________________________________________________________________
