_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_5 (Embedding)      (None, 7, 200)            1088731200
_________________________________________________________________
time_distributed_5 (TimeDist (None, 7, 64)             12800     
_________________________________________________________________
bidirectional_5 (Bidirection (None, 128)               66048     
_________________________________________________________________
dense_10 (Dense)             (None, 11)                1419      
=================================================================
Total params: 1,088,811,467
Trainable params: 80,267
Non-trainable params: 1,088,731,200
_________________________________________________________________
